Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Src/simple_scheduler.c
		"ldr    r2, =_tasks                         \n"
		"mov    r1, #" _STR(_TCB_SIZE) "             \n"
		"mul    r0, r3, r1                          \n"
		"add    r2, r2, r0                          \n"

		"ldr    r1, =_task_stacks                   \n"
		"ldr    r0, =" _STR(SCHEDULER_STACK_SIZE_BYTES) "\n"
		"mul    r0, r3, r0                          \n"
		"add    r0, r1, r0                          \n"
		"add    r0, r0, #" _STR(SCHEDULER_STACK_GUARD_BYTES) "\n"
		"msr    psplim, r0                          \n"
		"isb                                        \n"

		"ldr    r0, [r2, #" _STR(_TCB_SAVED_SP) "]    \n"
		"ldmia  r0!, {r4-r11}                       \n"
		"msr    psp, r0                             \n"
		"isb                                        \n"

		"movs   r0, #2                              \n"
		"msr    control, r0                         \n"
		"isb                                        \n"

		// Start TIM7 now that PSP and CONTROL are valid
		"push {r0, lr}                              \n"
		"bl SCHEDULER_StartTick                     \n"
		"pop {r0, lr}                               \n"

		"ldr    lr, =0xFFFFFFFD                     \n"
		"bx     lr                                  \n"
	);
}

// -------------------------------------------------------------------------
// Context switch - PendSV (preemptive)
// -------------------------------------------------------------------------

/**
 * @brief PendSV handler - preemptive context switch
 */
__attribute__((naked)) void PendSV_Handler(void){
	__asm volatile (
		"cpsid	i\n"

		"mrs	r0, psp\n"
		"stmdb	r0!, {r4-r11}\n"

		"tst	lr, #0x10\n"
		"it		eq\n"
		"vstmdbeq r0!, {s16-s31}\n"

		"ldr	r2, =_current_task\n"
		"ldr	r3, [r2]\n"
		"ldr	r4, =_tasks\n"

		"mov	r5, #" _STR(_TCB_SIZE) "\n"
		"mul	r3, r3, r5\n"
		"add	r4, r4, r3\n"
		"str	r0, [r4, #" _STR(_TCB_SAVED_SP) "]\n"
		"str	lr, [r4, #" _STR(_TCB_EXC_RETURN) "]\n"

		"push	{r1, lr}\n"
		"bl		SCHEDULER_SelectNextTask\n"
		"pop	{r1, lr}\n"

		"ldr	r2, =_current_task\n"
		"str	r0, [r2]\n"

		"ldr	r4, =_tasks\n"
		"mov	r5, #" _STR(_TCB_SIZE) "\n"
		"mul	r0, r0, r5\n"
		"add	r4, r4, r0\n"

		"ldrb	r1, [r4, #" _STR(_TCB_NEEDS_INIT) "]\n"
		"cmp	r1, #0\n"
		"beq	1f\n"

		"push	{r1, lr}\n"
		"mov	r0, r4\n"
		"ldr	r1, =_tasks\n"
		"sub	r0, r0, r1\n"
		"mov	r1, #" _STR(_TCB_SIZE) "\n"
		"udiv	r0, r0, r1\n"
		"mov	r1, r4\n"
		"bl		SCHEDULER_ReinitTask\n"
		"pop	{r1, lr}\n"

		"ldr	r4, =_tasks\n"
		"ldr	r2, =_current_task\n"
		"ldr	r3, [r2]\n"
		"mov	r5, #" _STR(_TCB_SIZE) "\n"
		"mul	r3, r3, r5\n"
		"add	r4, r4, r3\n"

		"1:\n"
		"ldr	r0, =_task_stacks\n"
		"ldr	r2, =_current_task\n"
		"ldr	r3, [r2]\n"
		"ldr	r2, =" _STR(SCHEDULER_STACK_SIZE_BYTES) "\n"
		"mul	r3, r3, r2\n"
		"add	r0, r0, r3\n"
		"add	r0, r0, #" _STR(SCHEDULER_STACK_GUARD_BYTES) "\n"
		"msr	psplim, r0\n"
		"isb\n"

		"ldr	r0, [r4, #" _STR(_TCB_SAVED_SP) "]\n"
		"ldr	lr, [r4, #" _STR(_TCB_EXC_RETURN) "]\n"

		"tst	lr, #0x10\n"
		"it		eq\n"
		"vldmiaeq r0!, {s16-s31}\n"

		"ldmia	r0!, {r4-r11}\n"
		"msr	psp, r0\n"

		"cpsie	i\n"
		"bx		lr\n"
	);
}

// -------------------------------------------------------------------------
// Tick source
// -------------------------------------------------------------------------

/**
 * @brief Start the TIM7 tick timer and enable its interrupt
 */
void SCHEDULER_StartTick(void){
	NVIC_ClearPendingIRQ(TIM7_IRQn);
	NVIC_EnableIRQ(TIM7_IRQn);
	TIMER_Start(TIM7);
	_scheduler_running = 1;
}

// -------------------------------------------------------------------------
// Scheduler statistics
// -------------------------------------------------------------------------

static uint32_t _last_print_tick = 0;

static void _pad(int n){
	while (n-- > 0) DEBUG_PRINTF(" ");
}

static void _printName(const char* s, int w){
	if (!s) s = "?";
	DEBUG_PRINTF("%s", s);
	int l = 0;
	while (s[l]) l++;
	_pad(w - l);
}

static void _printNum(uint32_t v, int w){
	char b[12];
	int i = 0;
	if (v == 0) {
		b[i++] = '0';
	} else {
		char r[12];
		int ri = 0;
		while (v) {
			r[ri++] = '0' + (v % 10);
			v /= 10;
		}
		while (ri--) b[i++] = r[ri];
	}
	b[i] = '\0';
	_pad(w - i);
	DEBUG_PRINTF("%s", b);
}

static void _printPct(uint32_t pct_x100, int w){
	uint32_t ip = pct_x100 / 100;
	uint32_t fp = pct_x100 % 100;
	char b[8];
	int i = 0;
	if (ip == 0) {
		b[i++] = '0';
	} else {
		char r[4];
		int ri = 0;
		while (ip) {
			r[ri++] = '0' + (ip % 10);
			ip /= 10;
		}
		while (ri--) b[i++] = r[ri];
	}
	b[i++] = '.';
	b[i++] = '0' + (fp / 10);
	b[i++] = '0' + (fp % 10);
	b[i++] = '%';
	b[i] = '\0';
	_pad(w - i);
	DEBUG_PRINTF("%s", b);
}

static void SCHEDULER_PrintStats(void){
	uint32_t now;
	uint32_t elapsed;
	uint32_t total = 0;
	uint32_t idle;
	uint32_t idle_pct;

	struct {
		uint32_t cycles;
		uint32_t min_cycles;
		uint32_t max_cycles;
		uint32_t preempts;
		uint32_t invocs;
		const char* name;
	} snap[SCHEDULER_MAX_TASKS];
	int snap_n = 0;

	__disable_irq();
	now = DWT->CYCCNT;
	elapsed = now - _last_stats_print_cycle;
	_last_stats_print_cycle = now;

	for (int i = 0; i < SCHEDULER_MAX_TASKS; i++) {
		if (i == SCHEDULER_IDLE_TASK_INDEX) continue;
		if (_tasks[i].active && _tasks[i].function) {
			SchedulerTaskStats_TypeDef *s = &_task_stats[i];
			snap[snap_n].cycles = s->total_cycles;
			snap[snap_n].min_cycles = (s->min_cycles == 0xFFFFFFFF) ? 0 : s->min_cycles;
			snap[snap_n].max_cycles = s->max_cycles;
			snap[snap_n].preempts = s->total_preempts;
			snap[snap_n].invocs = s->total_invocations;
			snap[snap_n].name = _tasks[i].pcName ? _tasks[i].pcName : "?";
			total += s->total_cycles;
			s->total_cycles = 0;
			s->total_preempts = 0;
			s->total_invocations = 0;
			s->min_cycles = 0xFFFFFFFF;
			s->max_cycles = 0;
			s->last_start_cycle = now;
			s->last_finish_cycle = now;
			snap_n++;
		}
	}

	idle = (elapsed > total) ? (elapsed - total) : 0;
	idle_pct = (idle * 10000ULL) / elapsed;
	__enable_irq();

	if (elapsed == 0) {
		return;
	}

	DEBUG_PRINTF("\r\n");
	_printName("Name", 14);
	_printName("min", 10);
	_printName("max", 10);
	_printName("avg", 10);
	_printName("%CPU", 7);
	_printName("Prempt", 9);
	_printName("Invoc", 8);
	DEBUG_PRINTF("\r\n");
	DEBUG_PRINTF("---------------------------------------------------------\r\n");

	for (int i = 0; i < snap_n; i++) {
		uint32_t pct = (snap[i].cycles * 10000ULL) / elapsed;
		uint32_t avg = snap[i].invocs ? (snap[i].cycles / snap[i].invocs) : 0;
		_printName(snap[i].name, 14);
		_printNum(snap[i].min_cycles, 10);
		_printNum(snap[i].max_cycles, 10);
		_printNum(avg, 10);
		_printPct(pct, 7);
		_printNum(snap[i].preempts, 9);
		_printNum(snap[i].invocs, 8);
		DEBUG_PRINTF("\r\n");
	}

