Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Src/simple_scheduler.c
	_printName("Idle", 14);
	_printNum(0, 10);
	_printNum(0, 10);
	_printNum(0, 10);
	_printPct(idle_pct, 7);
	_printNum(0, 9);
	_printNum(0, 8);
	DEBUG_PRINTF("\r\n");
	DEBUG_PRINTF("=========================================================\r\n");
}

/**
 * @brief TIM7 interrupt handler - scheduler tick
 *
 * Increments the system tick counter and marks tasks ready when
 * their period has elapsed, then pends PendSV for context switch.
 */
void TIM7_IRQHandler(void){
	uint32_t tim_flag;
	TIMER_GetFlag(TIM7, TIM_SR_UIF, &tim_flag);
	if (tim_flag) {
		TIMER_ClearFlag(TIM7, TIM_SR_UIF);

		_sys_tick_ms++;

		for (int i = 0; i < SCHEDULER_IDLE_TASK_INDEX; i++) {
			if (_tasks[i].active && _tasks[i].function != 0) {
				if ((_sys_tick_ms - _tasks[i].last_run_ms)
					>= _tasks[i].period_ms) {
					_tasks[i].last_run_ms = _sys_tick_ms;
					_tasks[i].ready       = 1;
				}
			}
		}

		SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;

		if (_scheduler_running
			&& (_sys_tick_ms - _last_print_tick >= 1000)) {
			_last_print_tick = _sys_tick_ms;
			_stats_pending = 1;
		}
	}
}

// -------------------------------------------------------------------------
// Public API
// -------------------------------------------------------------------------

SCHEDULER_Status_TypeDef SCHEDULER_Task_add(
	SCHEDULER_TaskFunction_TypeDef pvTaskCode,
	const char* pcName,
	uint32_t period_ms,
	uint8_t priority,
	uint8_t* taskIndex){

	if (taskIndex == NULL)  { return SCHEDULER_ERR_NOT_FOUND;  }
	if (pvTaskCode == NULL) { return SCHEDULER_ERR_TASK_INVALID; }

	int slot = -1;
	for (int i = 0; i < SCHEDULER_IDLE_TASK_INDEX; i++) {
		if (!_tasks[i].active) {
			slot = i;
			break;
		}
	}

	if (slot < 0) { return SCHEDULER_ERR_FULL; }

	_tasks[slot].function	    = pvTaskCode;
	_tasks[slot].period_ms	    = period_ms;
	_tasks[slot].last_run_ms    = _sys_tick_ms;
	_tasks[slot].priority	    = priority;
	_tasks[slot].stack_overflow = 0;
	_tasks[slot].pcName         = pcName;

	SCHEDULER_InitTaskStack(slot);

	_tasks[slot].ready		    = 1;
	_tasks[slot].active		    = 1;

	*taskIndex = (uint8_t)slot;

	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_Task_remove(int taskIndex){
	if (taskIndex < 0 || taskIndex >= SCHEDULER_IDLE_TASK_INDEX) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	_tasks[taskIndex].active     = 0;
	_tasks[taskIndex].function   = 0;
	_tasks[taskIndex].ready      = 0;
	_tasks[taskIndex].needs_init = 0;
	_tasks[taskIndex].pcName     = 0;

	return SCHEDULER_OK;
}

void SCHEDULER_System_init(void){
	TIMER_Config(TIM7, 200, 999, 0);
	TIMER_EnableIT(TIM7);

	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
	uint32_t cnt = DWT->CYCCNT;
	_last_stats_print_cycle = cnt;
	for (int i = 0; i < SCHEDULER_MAX_TASKS; i++) {
		_task_stats[i].last_start_cycle = cnt;
		_task_stats[i].last_finish_cycle = cnt;
		_task_stats[i].min_cycles = 0xFFFFFFFF;
		_task_stats[i].max_cycles = 0;
	}
}

SCHEDULER_Status_TypeDef SCHEDULER_Tick_get(uint32_t* tick){
	if (tick == 0) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	*tick = _sys_tick_ms;
	return SCHEDULER_OK;
}

void SCHEDULER_Tasks_run(void){
	__disable_irq();

	_tasks[SCHEDULER_IDLE_TASK_INDEX].function       = SCHEDULER_IdleTask;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].period_ms      = 0;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].last_run_ms    = 0;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].priority       = 0xFF;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].ready          = 1;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].active         = 1;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].needs_init     = 0;

	SCHEDULER_InitTaskStack(SCHEDULER_IDLE_TASK_INDEX);
	_tasks[SCHEDULER_IDLE_TASK_INDEX].pcName = "Idle";

	NVIC_SetPriority(PendSV_IRQn, 0xFF);
	NVIC_SetPriority(SVCall_IRQn, 0x00);
	NVIC_SetPriority(TIM7_IRQn, 0x80);

	FPU->FPCCR &= ~FPU_FPCCR_LSPEN_Msk;

	_current_task = SCHEDULER_SelectNextTask();

	// Enable ALL fault handlers so no crash goes undiagnosed
	SCB->SHCSR |= SCB_SHCSR_USGFAULTENA_Msk
				| SCB_SHCSR_BUSFAULTENA_Msk
				| SCB_SHCSR_MEMFAULTENA_Msk;

	// TIM7 is NOT started here - it starts in SCHEDULER_StartTick()
	// called from SVC_Handler after PSP and CONTROL are valid.
	// This prevents PendSV from ever firing before PSP is initialized.

	__enable_irq();

	__asm volatile ("SVC #0" : : : "memory");

	while (1) {
		__WFI();
	}
}

// -------------------------------------------------------------------------
// Debug API
// -------------------------------------------------------------------------

SCHEDULER_Status_TypeDef SCHEDULER_GetCurrentTask(int* taskIndex){
	if (taskIndex == 0) { return SCHEDULER_ERR_NOT_FOUND; }
	*taskIndex = _current_task;
	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_GetLastFault(
	volatile const Scheduler_Fault_Dump_TypeDef** dump){

	if (dump == 0) { return SCHEDULER_ERR_NOT_FOUND; }
	*dump = &g_sched_fault;
	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_GetTaskName(uint8_t task,
	const char** name){

	if (task >= SCHEDULER_MAX_TASKS) { return SCHEDULER_ERR_NOT_FOUND; }
	if (name == 0)                   { return SCHEDULER_ERR_NOT_FOUND; }
	*name = _tasks[task].pcName;
	return SCHEDULER_OK;
}

// -------------------------------------------------------------------------
// Fault handler - C core (captures state, then halts)
// -------------------------------------------------------------------------

/**
 * @brief Central fault handler - capture diagnostic state and halt
 *
 * @param [in] exc_return EXC_RETURN value from the fault context
 * @param [in] frame      Stack frame pointer (may be NULL)
 * @param [in] reason     Fault reason identifier
 */

void SCHEDULER_FaultHandler_C(uint32_t exc_return, uint32_t *frame,
	uint32_t reason){

	__disable_irq();

	g_sched_fault.magic   = SCHED_MAGIC;
	g_sched_fault.reason  = reason;
	g_sched_fault.task    = (uint32_t)_current_task;
	g_sched_fault.tick    = _sys_tick_ms;

	g_sched_fault.cfsr    = SCB->CFSR;
	g_sched_fault.hfsr    = SCB->HFSR;
	g_sched_fault.dfsr    = SCB->DFSR;
	g_sched_fault.afsr    = SCB->AFSR;
	g_sched_fault.mmfar   = SCB->MMFAR;
	g_sched_fault.bfar    = SCB->BFAR;
	g_sched_fault.icsr    = SCB->ICSR;
	g_sched_fault.shcsr   = SCB->SHCSR;

	g_sched_fault.msp     = __get_MSP();
	g_sched_fault.psp     = __get_PSP();
	g_sched_fault.psplim  = __get_PSPLIM();
	g_sched_fault.control = __get_CONTROL();
	g_sched_fault.exc_return = exc_return;

	if (reason == 4 && (SCB->CFSR & SCB_CFSR_STKOF_Msk)) {
		_tasks[_current_task].stack_overflow = 1;
	}

	if (frame) {
		g_sched_fault.r0  = frame[0];
		g_sched_fault.r1  = frame[1];
		g_sched_fault.r2  = frame[2];
		g_sched_fault.r3  = frame[3];
		g_sched_fault.r12 = frame[4];
		g_sched_fault.lr  = frame[5];
		g_sched_fault.pc  = frame[6];
		g_sched_fault.xpsr = frame[7];
	}

	char* reason_str;
	switch (reason) {
	case 1:
		reason_str = "Hard Fault (1)";
		break;
	case 2:
		reason_str = "MemManage Fault (2)";
		break;
	case 3:
		reason_str = "Bus Fault (3)";
		break;
	case 4:
		reason_str = "Usage Fault (4)";
		break;
	case 5:
		reason_str = "NMI Fault (5)";
		break;
	default:
		reason_str = "Unknown (?)";
		break;
	}

	DEBUG_PRINTF("\r\n===== SCHEDULER FAULT =====\r\n");
	DEBUG_PRINTF("Reason:%s Task:\"%s\"(%lu) Tick:%lu\r\n",
			reason_str,
			_tasks[_current_task].pcName ? _tasks[_current_task].pcName : "?",
			(uint32_t)_current_task,
			_sys_tick_ms);
	DEBUG_PRINTF("CFSR:0x%lx HFSR:0x%lx\r\n", g_sched_fault.cfsr, g_sched_fault.hfsr);
	DEBUG_PRINTF("DFSR:0x%lx AFSR:0x%lx\r\n", g_sched_fault.dfsr, g_sched_fault.afsr);
	DEBUG_PRINTF("MMFAR:0x%lx BFAR:0x%lx\r\n", g_sched_fault.mmfar, g_sched_fault.bfar);
	DEBUG_PRINTF("ICSR:0x%lx SHCSR:0x%lx\r\n", g_sched_fault.icsr, g_sched_fault.shcsr);
	DEBUG_PRINTF("MSP:0x%lx PSP:0x%lx PSPLIM:0x%lx\r\n", g_sched_fault.msp, g_sched_fault.psp, g_sched_fault.psplim);
	DEBUG_PRINTF("CONTROL:0x%lx EXC_RETURN:0x%lx\r\n", g_sched_fault.control, g_sched_fault.exc_return);

	if (frame) {
		DEBUG_PRINTF("R0:0x%lx R1:0x%lx R2:0x%lx R3:0x%lx\r\n",
			g_sched_fault.r0, g_sched_fault.r1,
			g_sched_fault.r2, g_sched_fault.r3);
		DEBUG_PRINTF("R12:0x%lx LR:0x%lx PC:0x%lx xPSR:0x%lx\r\n",
			g_sched_fault.r12, g_sched_fault.lr,
			g_sched_fault.pc, g_sched_fault.xpsr);
	}

	__BKPT(0);

	while (1) { __NOP(); }
}

// -------------------------------------------------------------------------
// Fault handlers - assembly stubs (tail-call C core)
// -------------------------------------------------------------------------

/**
 * @brief NMI handler - external / RCC clock loss / power failure
 */
__attribute__((naked)) void NMI_Handler(void){
	__asm volatile (
		"mov r0, lr\n"
		"tst r0, #4\n"
		"ite eq\n"
		"mrseq r1, msp\n"
		"mrsne r1, psp\n"
		"mov r2, #5\n"
		"b SCHEDULER_FaultHandler_C\n"
	);
}

/**
 * @brief HardFault handler - escalation from BusFault/MemManage or
 *        synchronous BusFault on unprivileged instruction fetch
 */
__attribute__((naked)) void HardFault_Handler(void){
	__asm volatile (
		"mov r0, lr\n"
		"tst r0, #4\n"
		"ite eq\n"
		"mrseq r1, msp\n"
		"mrsne r1, psp\n"
		"mov r2, #1\n"
		"b SCHEDULER_FaultHandler_C\n"
	);
}

/**
 * @brief MemManage handler - MPU violation
 */
__attribute__((naked)) void MemManage_Handler(void){
	__asm volatile (
		"mov r0, lr\n"
		"tst r0, #4\n"
		"ite eq\n"
		"mrseq r1, msp\n"
		"mrsne r1, psp\n"
		"mov r2, #2\n"
		"b SCHEDULER_FaultHandler_C\n"
	);
}

/**
 * @brief BusFault handler - memory transaction error (precise / imprecise
 *        data or instruction fetch), including stack-push to invalid address
 */
__attribute__((naked)) void BusFault_Handler(void){
	__asm volatile (
		"mov r0, lr\n"
		"tst r0, #4\n"
		"ite eq\n"
		"mrseq r1, msp\n"
		"mrsne r1, psp\n"
		"mov r2, #3\n"
		"b SCHEDULER_FaultHandler_C\n"
	);
}

/**
 * @brief UsageFault handler - stack overflow, undefined instruction,
 *        unaligned access, divide-by-zero
 */
__attribute__((naked)) void UsageFault_Handler(void){
	__asm volatile (
		"mov r0, lr\n"
		"tst r0, #4\n"
		"ite eq\n"
		"mrseq r1, msp\n"
		"mrsne r1, psp\n"
		"mov r2, #4\n"
		"b SCHEDULER_FaultHandler_C\n"
	);
}
